Terraform Plan:

```
module.cloudflare_dns.data.cloudflare_zone.zone: Reading...
module.cloudflare_dns.data.cloudflare_zone.zone: Read complete after 0s [id=7d3f63ac039666ab600b5796c54e7ba6]
oci_identity_compartment.k8s: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaa4bbfmz332ypqxr6icuitp54jj7czdp4qliuo575ytuqakppgtmra]
module.virtual_machine.data.oci_identity_availability_domains.ads: Reading...
module.virtual_network.oci_core_vcn.vcn["vcn1"]: Refreshing state... [id=ocid1.vcn.oc1.eu-frankfurt-1.amaaaaaaic6ifviawy53vzv7ylnbovxzlk6gdl3wj62qt7pazvsl3pinvxiq]
module.virtual_machine.data.oci_identity_availability_domains.ads: Read complete after 1s [id=IdentityAvailabilityDomainsDataSource-2220574233]
module.virtual_network.oci_core_internet_gateway.igw["vcn1"]: Refreshing state... [id=ocid1.internetgateway.oc1.eu-frankfurt-1.aaaaaaaafkt7nrvasfyvu4a7daqfqskkfh4vmbqpye7qr35abqnhrumie32a]
module.virtual_network.oci_core_network_security_group.nsg["vcn1"]: Refreshing state... [id=ocid1.networksecuritygroup.oc1.eu-frankfurt-1.aaaaaaaaphiusldsxpmy7odws7mwaitxvfeu52ntgbb2vkwe7fzhvyckb45q]
module.virtual_network.oci_core_route_table.rt["vcn1"]: Refreshing state... [id=ocid1.routetable.oc1.eu-frankfurt-1.aaaaaaaa5jyv5xby72ed73eqsxt3t7o6z7symzmk3we5rhpongsnakijdzba]
module.virtual_network.oci_core_network_security_group_security_rule.nsg_rule["rule2"]: Refreshing state... [id=73C8D4]
module.virtual_network.oci_core_network_security_group_security_rule.nsg_rule["rule3"]: Refreshing state... [id=868C1D]
module.virtual_network.oci_core_network_security_group_security_rule.nsg_rule["rule1"]: Refreshing state... [id=96F721]
module.virtual_network.oci_core_subnet.subnet["subnet1"]: Refreshing state... [id=ocid1.subnet.oc1.eu-frankfurt-1.aaaaaaaatfy3s5otqei4lcl7czf6jk7bliptcfwx4e35otvnd5muldjqutea]
module.virtual_machine.oci_core_instance.vm["worker2"]: Refreshing state... [id=ocid1.instance.oc1.eu-frankfurt-1.antheljtic6ifvicwkkm6vc2zy2coshuuhmpsxewt2sgrwox5uxzq25kafga]
module.virtual_machine.oci_core_instance.vm["worker1"]: Refreshing state... [id=ocid1.instance.oc1.eu-frankfurt-1.antheljtic6ifvicyrvcdxqz6zmx6ahdsk44e4q23h6zabdlvo2csswwy57a]
module.cloudflare_dns.cloudflare_record.a_record["worker1"]: Refreshing state... [id=85b2b2202a344df108f0d1f90ab7a0c6]
module.cloudflare_dns.cloudflare_record.a_record["worker2"]: Refreshing state... [id=7b5a79ce475f54e4ce5bc1b28e907dac]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.virtual_machine.oci_core_volume.volume["worker1"] will be created
  + resource "oci_core_volume" "volume" {
      + auto_tuned_vpus_per_gb = (known after apply)
      + availability_domain    = "YnJT:EU-FRANKFURT-1-AD-3"
      + backup_policy_id       = (known after apply)
      + compartment_id         = "ocid1.tenancy.oc1..aaaaaaaao7q2d72t4s3fe2wjrthjlux4eeazjbh4wkiilmdg4t7fd5jdn5ya"
      + defined_tags           = (known after apply)
      + display_name           = "worker1_50GB"
      + freeform_tags          = (known after apply)
      + id                     = (known after apply)
      + is_auto_tune_enabled   = (known after apply)
      + is_hydrated            = (known after apply)
      + kms_key_id             = (known after apply)
      + size_in_gbs            = "50"
      + size_in_mbs            = (known after apply)
      + state                  = (known after apply)
      + system_tags            = (known after apply)
      + time_created           = (known after apply)
      + volume_backup_id       = (known after apply)
      + volume_group_id        = (known after apply)
      + vpus_per_gb            = (known after apply)
    }

  # module.virtual_machine.oci_core_volume_attachment.volume_attachment["worker1"] will be created
  + resource "oci_core_volume_attachment" "volume_attachment" {
      + attachment_type                     = "paravirtualized"
      + availability_domain                 = (known after apply)
      + chap_secret                         = (known after apply)
      + chap_username                       = (known after apply)
      + compartment_id                      = (known after apply)
      + device                              = (known after apply)
      + display_name                        = (known after apply)
      + encryption_in_transit_type          = (known after apply)
      + id                                  = (known after apply)
      + instance_id                         = "ocid1.instance.oc1.eu-frankfurt-1.antheljtic6ifvicyrvcdxqz6zmx6ahdsk44e4q23h6zabdlvo2csswwy57a"
      + ipv4                                = (known after apply)
      + iqn                                 = (known after apply)
      + is_agent_auto_iscsi_login_enabled   = (known after apply)
      + is_multipath                        = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + is_read_only                        = (known after apply)
      + is_shareable                        = (known after apply)
      + iscsi_login_state                   = (known after apply)
      + multipath_devices                   = (known after apply)
      + port                                = (known after apply)
      + state                               = (known after apply)
      + time_created                        = (known after apply)
      + use_chap                            = (known after apply)
      + volume_id                           = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

Plan saved to GH artifacts.